Public Attributes | List of all members
API_RendEffects Struct Reference
Rendering Scenes and Settings
The representation of the Rendering Settings / Effects tab page. More...
#include <APIdefs_Environment.h>
 Public Attributes
 API_ModulID  | rendererID
The module ID of the rendering engine.
 bool  | useBkgAlpha
Use alpha channel for transparency.
Detailed Description
The representation of the Rendering Settings / Effects tab page.
Remarks
This structure is used by the ACAPI_Rendering_GetRenderingSets and ACAPI_Rendering_ChangeRenderingSets functions to get and modify the Effects "Rendering Settings" tab page. See an example of using this structure at the description of ACAPI_Rendering_ChangeRenderingSets.